Repository: 84000/data-translation-memory
Catalog: Toh_438-Tara_with_Twenty-One_Verses_of_Homage-v2.tmx
Source language: bo
Languages: en

source: སྒྲོལ་མ་ལ་ཕྱག་འཚལ་ཉི་ཤུ་རྩ་གཅིག་གིས་བསྟོད་པ་ཕན་ཡོན་དང་བཅས་པ།
en: Praise to Tārā with Twenty-One Verses of Homage

source: རྗེ་བཙུན་མ་འཕགས་མ་སྒྲོལ་མ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the honored, noble lady Tārā!

source: ཕྱག་འཚལ་སྒྲོལ་མ་མྱུར་མ་དཔའ་མོ། །སྤྱན་ནི་སྐད་ཅིག་གློག་དང་འདྲ་མ། །
en: Homage to Tārā, swift and gallant, Whose glance is instantaneous like lightning.

source: འཇིག་རྟེན་གསུམ་མགོན་ཆུ་སྐྱེས་ཞལ་གྱི། །གེ་སར་ཕྱེ་བ་ལས་ནི་བྱུང་མ། །
en: You arose from the heart of the blossoming lotus That is the face of the lord of the three worlds.

source: ཕྱག་འཚལ་སྟོན་ཀའི་ཟླ་བ་ཀུན་དུ། །གང་བ་བརྒྱ་ནི་བརྩེགས་པའི་ཞལ་མ། །
en: Homage to you whose face resembles One hundred autumn full moons gathered;

source: སྐར་མ་སྟོང་ཕྲག་ཚོགས་པ་རྣམས་ཀྱིས། །རབ་ཏུ་ཕྱེ་བའི་འོད་རབ་འབར་མ། །
en: Your brilliant radiance blazes, Like a thousand clusters of stars.

source: ཕྱག་འཚལ་གསེར་སྔོ་ཆུ་ནས་སྐྱེས་ཀྱི། །པདྨས་ཕྱག་ནི་རྣམ་པར་བརྒྱན་མ། །
en: Homage to you, whose hand is graced By a golden-blue lotus flower.

source: སྦྱིན་པ་བརྩོན་འགྲུས་དཀའ་ཐུབ་ཞི་བ། །བཟོད་པ་བསམ་གཏན་སྤྱོད་ཡུལ་ཉིད་མ། །
en: You embody generosity, diligence, endurance, Serenity, patience, and concentration.

source: ཕྱག་འཚལ་དེ་བཞིན་གཤེགས་པའི་གཙུག་ཏོར། །མཐའ་ཡས་རྣམ་པར་རྒྱལ་བར་སྤྱོད་མ། །
en: Homage to you, whose triumphs are endless, Jewel on the Tathāgata’s crown.

source: མ་ལུས་ཕ་རོལ་ཕྱིན་པ་ཐོབ་པའི། །རྒྱལ་བའི་སྲས་ཀྱིས་ཤིན་ཏུ་བསྟེན་མ། །
en: You are well attended to by the heirs of the victors, Who have mastered all the perfections.

source: !ཕྱག་འཚལ་ཏུཏྟྭ་ར་ཧཱུྃ་ཡི་གེ། །འདོད་དང་ཕྱོགས་དང་ནམ་མཁའ་གང་མ། །
en: Homage to Tuttārā, who with hūṁ Fulfills all wishes to the bounds of space.

source: འཇིག་རྟེན་བདུན་པོ་ཞབས་ཀྱིས་མནན་ཏེལུས་པ་མེད་པར་འགུགས་པར་ནུས་མ། །
en: You trample the seven worlds underfoot, And possess the strength to summon all.

source: ཕྱག་འཚལ་བརྒྱ་བྱིན་མེ་ལྷ་ཚངས་པ། །རླུང་ལྷ་སྣ་ཚོགས་དབང་ཕྱུག་མཆོད་མ། །
en: Homage to you, praised by Śakra, Agni, Brahmā, maruts, and Śiva.

source: འབྱུང་པོ་རོ་ལངས་དྲི་ཟ་རྣམས་དང་། །གནོད་སྦྱིན་ཚོགས་ཀྱིས་མདུན་ནས་བསྟོད་མ། །
en: The hosts of bhūtas, vetālas, gandharvas, And yakṣas pay tribute to you.

source: ཕྱག་འཚལ་ཏྲད་ཅེས་བྱ་དང་ཕཊ་ཀྱིས། །ཕ་རོལ་འཁྲུལ་འཁོར་རབ་ཏུ་འཇོམས་མ། །
en: Homage to you, who with traṭ and phaṭ Crush the magical devices of other traditions.

source: གཡས་བསྐུམ་གཡོན་བརྐྱང་ཞབས་ཀྱིས་མནན་ཏེམེ་འབར་འཁྲུགས་པ་ཤིན་ཏུ་འབར་མ། །
en: With your right leg bent and your left leg extended, You shine amid flames blazing wildly.

source: ཕྱག་འཚལ་ཏུ་རེ་འཇིགས་པ་ཆེན་མོ། །བདུད་ཀྱི་དཔའ་བོ་རྣམ་པར་འཇོམས་མ། །
en: Homage to Turā, the fearsome lady, Destroyer of the most powerful demons.

source: ཆུ་སྐྱེས་ཞལ་ནི་ཁྲོ་གཉེར་ལྡན་མཛད། །དགྲ་བོ་ཐམས་ཅད་མ་ལུས་གསོད་མ། །
en: With your lotus face and stern frown, You are the slayer of each and every foe!

source: ཕྱག་འཚལ་དཀོན་མཆོག་གསུམ་མཚོན་ཕྱག་རྒྱའི། །སོར་མོས་ཐུགས་ཀར་རྣམ་པར་བརྒྱན་མ། །
en: Homage to you, whose fingers grace your heart, Displaying the mudrā of the Three Jewels.

source: མ་ལུས་ཕྱོགས་ཀྱི་འཁོར་ལོས་བརྒྱན་པའི། །རང་གི་འོད་ཀྱི་ཚོགས་རྣམས་འཁྲུག་མ། །
en: Graced by wheels in all directions, Your natural radiance overwhelms all.

source: ཕྱག་འཚལ་རབ་ཏུ་དགའ་བ་བརྗིད་པའི། །དབུ་རྒྱན་འོད་ཀྱི་ཕྲེང་བ་སྤེལ་མ། །
en: Homage to you, supremely joyous, Your splendorous crown spreading garlands of light.

source: བཞད་པ་རབ་བཞད་ཏུ་ཏྟྭ་ར་ཡིས། །བདུད་དང་འཇིག་རྟེན་དབང་དུ་མཛད་མ། །
en: Tuttārā, smiling and laughing, You bring demons and worlds within your control.

source: ཕྱག་འཚལ་ས་གཞི་སྐྱོང་བའི་ཚོགས་རྣམས། །ཐམས་ཅད་འགུགས་པར་ནུས་མ་ཉིད་མ། །
en: Homage to you, who can summon The hosts of earthly guardians.

source: ཁྲོ་གཉེར་གཡོ་བའི་ཡི་གེ་ཧཱུཾ་གིས། །ཕོངས་པ་ཐམས་ཅད་རྣམ་པར་སྒྲོལ་མ། །
en: Knitting your quivering brows, with the syllable hūṁ You deliver from every misfortune.

source: !ཕྱག་འཚལ་ཟླ་བའི་རྩེ་མོས་དབུ་བརྒྱན། །བརྒྱན་པ་ཐམས་ཅད་ཤིན་ཏུ་འབར་མ། །
en: Homage to you, so brightly adorned, With a sliver of moon as your crown,

source: རལ་པའི་ཁྲོད་ན་འོད་དཔག་མེད་ལས། །རྟག་པར་ཤིན་ཏུ་འོད་ནི་མཛད་མ། །
en: Your locks always graced by Amitābha, Whose bright light streams forever forth.

source: ཕྱག་འཚལ་བསྐལ་པ་ཐ་མའི་མེ་ལྟར། །འབར་བའི་ཕྲེང་བའི་དབུས་ན་གནས་མ། །
en: Homage to you, seated amid blazing flames That resemble the fire that ends an eon.

source: གཡས་བརྐྱང་གཡོན་བསྐུམ་ཀུན་ནས་བསྐོར་དགས། །
en: Immersed in joy, your right leg extends, and the left is bent.

source: དགྲ་ཡི་དཔུང་ནི་རྣམ་པར་འཇོམས་མ། །
en: Thus, you crush legions of foes.

source: ཕྱག་འཚལ་ས་གཞིའི་ངོས་ལ་ཕྱག་གི། །མཐིལ་གྱིས་བསྣུན་ཅིང་ཞབས་ཀྱིས་བརྡུང་མ། །
en: Homage to you, who on the earth’s surface Strike your palms and stamp your feet;

source: ཁྲོ་གཉེར་ཅན་མཛད་ཡི་གེ་ཧཱུྃ་གིས། །རིམ་པ་བདུན་པོ་རྣམས་ནི་འགེམས་མ། །
en: The hūṁ that is formed by your frown Smashes the seven netherworlds to nothing but dust.

source: ཕྱག་འཚལ་བདེ་མ་དགེ་མ་ཞི་མ། །མྱ་ངན་འདས་ཞི་སྤྱོད་ཡུལ་ཉིད་མ། །
en: Homage to you, blissful, gracious, and tranquil, Whose domain is the peace of nirvāṇa.

source: སྭཱ་ཧཱ་ཨོཾ་དང་ཡང་དག་ལྡན་པས། །སྡིག་པ་ཆེན་པོ་འཇོམས་པ་ཉིད་མ། །
en: In perfect union with svāhā and oṁ, You lay to waste every terrible evil.

source: ཕྱག་འཚལ་ཀུན་ནས་བསྐོར་རབ་དགའ་བའི། །དགྲ་ཡི་ལུས་ནི་རབ་ཏུ་འགེམས་མ། །
en: Homage to you, who, immersed in rapture, Shatter the bodies of all foes.

source: ཡི་གེ་བཅུ་པའི་ངག་ནི་བཀོད་པའི། །རིག་པ་ཧཱུྃ་ལས་སྒྲོན་མ་ཉིད་མ། །
en: You shine with the knowledge-syllable hūṁ, As your mantra’s ten syllables are set forth.

source: ཕྱག་འཚལ་ཏུ་རེའི་ཞབས་ནི་བརྡབས་པས། །ཧཱུྃ་གི་རྣམ་པའི་ས་བོན་ཉིད་མ། །
en: Homage to Turā, your feet stomping, Formed from the seed of the syllable hūṁ.

source: རི་རབ་མན་དཱ་ར་དང་འབིགས་བྱེད། །འཇིག་རྟེན་གསུམ་རྣམས་གཡོ་བ་ཉིད་མ། །
en: The mountains of Meru, Mandara, and Vindhya, And all the three worlds—you cause them to quake.

source: ཕྱག་འཚལ་ལྷ་ཡི་མཚོ་ཡི་རྣམ་པའི། །རི་དགས་རྟགས་ཅན་ཕྱག་ན་བསྣམས་མ། །
en: Homage to you, who hold in your hand A deer-marked moon like a divine lake.

source: ཏཱ་ར་གཉིས་བརྗོད་ཕཊ་ཀྱི་ཡི་གེས། །དུག་རྣམས་མ་ལུས་པར་ནི་སེལ་མ། །
en: With tāra uttered twice and then with phaṭ, You eliminate all poisons.

source: ཕྱག་འཚལ་ལྷ་ཡི་ཚོགས་རྣམས་རྒྱལ་པོ། །ལྷ་དང་མིའམ་ཅི་ཡིས་བསྟེན་མ། །
en: Homage to you, sovereign of divine hosts, Served by gods and kiṃnaras.

source: ཀུན་ནས་གོ་ཆ་དགའ་བའི་བརྗིད་ཀྱིས། །རྩོད་དང་རྨི་ལམ་ངན་པ་སེལ་མ། །
en: Your resplendence, an armor of joy, Pacifies strife and clears away nightmares.

source: ཕྱག་འཚལ་ཉི་མ་ཟླ་བ་རྒྱས་པའི། །སྤྱན་གཉིས་པོ་ལ་འོད་རབ་གསལ་མ། །
en: Homage to you, whose two eyes shine brightly Like the sun and the moon when it’s full.

source: ཧ་ར་གཉིས་བརྗོད་ཏུ་ཏྟྭ་ར་ཡིས། །ཤིན་ཏུ་དྲག་པོའི་རིམས་ནི་སེལ་མ། །
en: Tuttārā, with twice-uttered hara, You pacify the most intractable ills.

source: ཕྱག་འཚལ་དེ་ཉིད་གསུམ་རྣམས་བཀོད་པའི། །ཞི་བའི་མཐུ་དང་ཡང་དག་ལྡན་མ། །
en: Homage to you, who have the power to pacify, You display the three true natures.

source: གདོན་དང་རོ་ལངས་གནོད་སྦྱིན་ཚོགས་རྣམས། །འཇོམས་པ་ཏུ་རེ་རབ་མཆོག་ཉིད་མ། །
en: Turā, supreme lady, you destroy The hordes of grahas, vetālas, and yakṣas.

source: རྩ་བའི་སྔགས་ཀྱིས་བསྟོད་པ་འདི་དང་། །ཕྱག་འཚལ་བ་ནི་ཉི་ཤུ་རྩ་གཅིག །ལྷ་མོ་ལ་གུས་ཡང་དག་ལྡན་པའི། །བློ་ལྡན་གང་གིས་རབ་ཏུ་བརྗོད་པས། །
en: This praise by means of the root mantra— The twenty-one verses of homage Should be recited in earnest by the wise, Who are filled with devotion for the goddess.

source: སྲོད་དང་ཐོ་རངས་ལངས་པར་བྱས་ནསདྲན་པས་མི་འཇིགས་ཐམས་ཅད་རབ་སྟེར། །
en: Recalling it at dusk and also when rising at dawn Will grant them freedom from every fear.

source: སྡིག་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བ། །ངན་འགྲོ་ཐམས་ཅད་འཇོམས་པ་ཉིད་དོ། །
en: It will pacify all misdeeds, And destroy all evil destinies.

source: རྒྱལ་བ་བྱེ་བ་ཕྲག་བདུན་རྣམས་ཀྱིས། །མྱུར་དུ་དབང་ནི་བསྐུར་བར་འགྱུར་ལ། །
en: Soon they will receive empowerment From seven million conquerors.

source: འདི་ལས་ཆེ་བ་ཉིད་ནི་འཐོབ་ཅིང་། །སངས་རྒྱས་གོ་འཕང་མཐར་ཐུག་དེར་འགྲོ། །
en: Beyond this, they shall attain greatness, And proceed to the ultimate state of buddhahood.

source: དེ་ཡི་དུག་ནི་དྲག་པོ་ཆེན་པོ། །བརྟན་གནས་པའམ་གཞན་ཡང་འགྲོ་བ། །ཟོས་པ་དང་ནི་འཐུངས་པ་ཉིད་ཀྱང་། །དྲན་པས་རབ་ཏུ་སེལ་བ་ཉིད་ཐོབ། །
en: If they recall this praise all dreadful poisons, Whether natural or manufactured, Whether eaten or imbibed, Will be utterly neutralized.

source: གདོན་དང་རིམས་དང་དུག་གིས་གཟིར་བའི། །སྡུག་བསྔལ་ཚོགས་ནི་རྣམ་པར་སྤོང་སྟེ། །སེམས་ཅན་གཞན་པ་རྣམས་ལ་ཡང་ངོ་། །
en: This will dispel the heap of suffering Inflicted by grahas, infectious diseases, and poisons, Even in other beings.

source: གཉིས་གསུམ་བདུན་དུ་མངོན་པར་བརྗོད་ན། །བུ་འདོད་པས་ནི་བུ་ཐོབ་འགྱུར་ཞིང་། །
en: If chanted twice, thrice, or seven times, Those who want children will come to have them,

source: ནོར་འདོད་པས་ནི་ནོར་རྣམས་ཉིད་ཐོབ། །
en: Those who seek wealth will come to have that,

source: འདོད་པ་ཐམས་ཅད་ཐོབ་པར་འགྱུར་ཏེ། །
en: Each and every wish will be fulfilled,

source: བགེགས་རྣམས་མེད་ཅིང་སོ་སོར་འཇོམས་འགྱུར། །
en: And obstacles, entirely vanquished, will be no more.

source: བཅོམ་ལྡན་འདས་མ་སྒྲོལ་མ་ལ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བསྟོད་པ་གསུངས་པ་རྫོགས་སོ།། །།
en: This completes the praise to the Blessed Tārā as spoken by the completely perfect Buddha.
